{
  "architectures": [
    "RoutingFreeOlmoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "clip_qkv": null,
  "density_target": 0.25,
  "dtype": "bfloat16",
  "eos_token_id": 50279,
  "eta_coef": 0.02,
  "gate_act_fn": "linear",
  "gate_bias": true,
  "gate_norm": "l2",
  "gate_proj_rank": 128,
  "gate_scale": true,
  "gate_temperature": 1.0,
  "gate_threshold": 1.0,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "lambda_coef": 0.1,
  "max_position_embeddings": 4096,
  "model_type": "routing_free_olmoe",
  "n_experts": 64,
  "norm_topk_prob": false,
  "num_attention_heads": 16,
  "num_experts": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 16,
  "num_key_value_heads": 16,
  "output_gate_scores": true,
  "output_router_logits": false,
  "pad_token_id": 1,
  "per_expert_aux_loss_coef": 0.5,
  "per_token_aux_loss_coef": 0.5,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.01,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.3",
  "use_cache": false,
  "vocab_size": 50304
}
