{
  "architectures": [
    "MixtralForCausalLM"
  ],
  "attention_dropout": 0.05,
  "bos_token_id": 1,
  "dtype": "bfloat16",
  "eos_token_id": 2,
  "head_dim": 32,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 256,
  "max_position_embeddings": 2048,
  "model_type": "mixtral",
  "num_attention_heads": 32,
  "num_experts_per_tok": 6,
  "num_hidden_layers": 32,
  "num_key_value_heads": 16,
  "num_local_experts": 24,
  "output_router_logits": false,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.01,
  "router_jitter_noise": 0.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.3",
  "use_cache": true,
  "vocab_size": 50257
}
