{
  "architectures": [
    "RoutingFreeDeepseekV3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.05,
  "bos_token_id": 0,
  "density_target": 0.1,
  "eos_token_id": 1,
  "eta_coef": 1.2,
  "first_k_dense_replace": 1,
  "gate_act_fn": "relu",
  "gate_bias": true,
  "gate_norm": "l2",
  "gate_proj_rank": 16,
  "gate_scale": true,
  "gate_temperature": 1.0,
  "gate_threshold": 0.2,
  "head_dim": 16,
  "hidden_act": "silu",
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "kv_lora_rank": 128,
  "lambda_coef": 1e-05,
  "max_position_embeddings": 4096,
  "model_type": "routing_free_deepseek_v3",
  "moe_intermediate_size": 128,
  "n_attention_heads": 16,
  "n_experts": 12,
  "n_hidden_layers": 12,
  "n_key_value_heads": 16,
  "output_gate_scores": true,
  "per_expert_aux_loss_coef": 0.5,
  "per_token_aux_loss_coef": 0.5,
  "pretraining_tp": 1,
  "q_lora_rank": 256,
  "qk_head_dim": 80,
  "qk_nope_head_dim": 64,
  "qk_rope_head_dim": 16,
  "rms_norm_eps": 1e-06,
  "rope_interleave": true,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.52.0.dev0",
  "use_cache": true,
  "v_head_dim": 64,
  "vocab_size": 50257
}
